export default function echelonMobilityTowedarray(symbolset) {
  if (symbolset == "10") {
    return [
      { code: "00", name: "Не визначено", sidc: "10031000000000000000" },
      { code: "11", name: "Команда/Екіпаж", sidc: "10031000110000000000" },
      { code: "12", name: "Відділення", sidc: "10031000120000000000" },
      { code: "13", name: "Секція", sidc: "10031000130000000000" },
      { code: "14", name: "Взвод/загін", sidc: "10031000140000000000" },
      {
        code: "15",
        name: "Рота/батарея/військо",
        sidc: "10031000150000000000"
      },
      { code: "16", name: "Батальйон/ескадрон", sidc: "10031000160000000000" },
      { code: "17", name: "Полк/група", sidc: "10031000170000000000" },
      { code: "18", name: "Бригада", sidc: "10031000180000000000" },
      { code: "21", name: "Дивізія", sidc: "10031000210000000000" },
      { code: "22", name: "Корпус/Морські експедиційні сили", sidc: "10031000220000000000" },
      { code: "23", name: "Армія", sidc: "10031000230000000000" },
      { code: "24", name: "Група армій/фронт", sidc: "10031000240000000000" },
      { code: "25", name: "Військовий округ/ТВД", sidc: "10031000250000000000" },
      {
        code: "26",
        name: "Командування",
        sidc: "10031000260000000000"
      }
    ];
  }
  // add signals intelligence
  if (symbolset == "15") {
    return [
      { code: "00", name: "Не визначено", sidc: "10031500000000000000" },
      {
        code: "31",
        name: "Колісний (обмежене міждержавне пересічення)",
        sidc: "10031500310000000000"
      },
      {
        code: "32",
        name: "Колісний (міждержавне пересічення)",
        sidc: "10031500320000000000"
      },
      { code: "33", name: "Гусеничний", sidc: "10031500330000000000" },
      {
        code: "34",
        name: "Колісна та гусенична комбінація",
        sidc: "10031500340000000000"
      },
      { code: "35", name: "Буксирований", sidc: "10031500350000000000" },
      { code: "36", name: "Залізничний", sidc: "10031500360000000000" },
      { code: "37", name: "Тяглові тварини", sidc: "10031500370000000000" },
      {
        code: "41",
        name: "Насніжний (водій)",
        sidc: "10031500410000000000"
      },
      { code: "42", name: "Санний", sidc: "10031500420000000000" },
      { code: "51", name: "Баржа", sidc: "10031500510000000000" },
      { code: "52", name: "«Амфі́бія»", sidc: "10031500520000000000" }
    ];
  }
  if (symbolset == "27") {
    return [
      { code: "00", name: "Не визначено", sidc: "10032700000000000000" },
      { code: "71", name: "Лідер", sidc: "10032700710000000000" }
    ];
  }
  if (symbolset == "30" || symbolset == "35") {
    return [
      { code: "00", name: "Не визначено", sidc: "10033000000000000000" },
      { code: "61", name: "Буксирований сонар (короткий)", sidc: "10033000610000000000" },
      { code: "62", name: "Буксирований сонар (довгий)", sidc: "10033000620000000000" }
    ];
  }

  return undefined;
}
